Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/default/python-tornado/target_count_13/repeat_25/6.txt
2020/01/23 01:34:13 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8006/
2020/01/23 01:34:43 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 19846 requests
Server Software:        TornadoServer/4.5.3
Server Hostname:        192.168.3.100
Server Port:            8006
Document Path:          /
Document Length:        1000 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      19846
Failed requests:        0
Total transferred:      23755662 bytes
HTML transferred:       19846000 bytes
Requests per second:    661.53 [#/sec] (mean)
Time per request:       151.164 [ms] (mean)
Time per request:       1.512 [ms] (mean, across all concurrent requests)
Transfer rate:          773.30 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       4
Processing:     4  151  71.2    143     614
Waiting:        4  151  71.2    143     614
Total:          7  151  71.2    144     614
Percentage of the requests served within a certain time (ms)
  50%    144
  66%    152
  75%    160
  80%    167
  90%    204
  95%    284
  98%    412
  99%    494
 100%    614 (longest request)
{"connect":{"max":4,"mean":0,"median":0,"min":0,"stdDev":0.20000000298023224},"percentiles":{"100":614,"50":144,"66":152,"75":160,"80":167,"90":204,"95":284,"98":412,"99":494},"processing":{"max":614,"mean":151,"median":143,"min":4,"stdDev":71.19999694824219},"total":{"max":614,"mean":151,"median":144,"min":7,"stdDev":71.19999694824219},"waiting":{"max":614,"mean":151,"median":143,"min":4,"stdDev":71.19999694824219}}
2020/01/23 01:34:43 Matched stat line [Connect:        0    0   0.2      0       4 Connect 0 0 0.2 0 4]
2020/01/23 01:34:43 Matched stat line [Processing:     4  151  71.2    143     614 Processing 4 151 71.2 143 614]
2020/01/23 01:34:43 Matched stat line [Waiting:        4  151  71.2    143     614 Waiting 4 151 71.2 143 614]
2020/01/23 01:34:43 Matched stat line [Total:          7  151  71.2    144     614 Total 7 151 71.2 144 614]
2020/01/23 01:34:43 Matched percentline [  50%    144 50 144]
2020/01/23 01:34:43 Matched percentline [  66%    152 66 152]
2020/01/23 01:34:43 Matched percentline [  75%    160 75 160]
2020/01/23 01:34:43 Matched percentline [  80%    167 80 167]
2020/01/23 01:34:43 Matched percentline [  90%    204 90 204]
2020/01/23 01:34:43 Matched percentline [  95%    284 95 284]
2020/01/23 01:34:43 Matched percentline [  98%    412 98 412]
2020/01/23 01:34:43 Matched percentline [  99%    494 99 494]
2020/01/23 01:34:43 Matched percentline [ 100%    614 100 614]